# Data Management and Database Design

## Answering SQL Questions


### Write SQL statements to do the following on project database:

In [1]:
import sqlite3
import pandas as pd

In [2]:
connection = sqlite3.connect("projectTwit.db")
cursor = connection.cursor()
cursor2= connection.cursor()

## 1. Select columns

In [3]:
output= "SELECT user_id, user_name from user limit 10"
cursor.execute(output)
pd.DataFrame(cursor.fetchall(), columns=['user_id','user_name'])

            user_id              user_name
0           @ExpoDX          DXWorldEXPO ®
1     @TechNewsRprt        TechNews Report
2      @ScopeOnline                  SCOPE
3        @nschaetti  NS.ai (Nils Schaetti)
4  @gabrielanthonyp      GabrielAnthony P.
5   @AffideaIreland        Affidea Ireland
6        @freetoopt              freetoopt
7    @Chuck_Moeller        Chuck@SteamGear
8         @Shuks_07         Saurabh Shukla
9    @RelevantTrack         Relevant Track

## 2. Filter rows

In [4]:
output= "SELECT * from user where followers>150000"
cursor.execute(output)
pd.DataFrame(cursor.fetchall(), columns=['user_id','user_name','followers','following','tweet_count'])

,user_id,user_name,followers,following,tweet_count
0,@evankirstel,Evan Kirstel is at #MWC18!,171102,165217,618354
1,@grattonboy,Dean Anthony Gratton,345866,14218,227188
2,@Wipro,Wipro Limited,371224,866,19580
3,@KirkDBorne,Kirk Borne,187943,44551,83188
4,@Merca20,Merca2.0,501742,45906,161242
5,@m_kayveas,MKayveas,153029,1905,47610
6,@TheNationalUAE,The National,890112,149,100484
7,@grattongirl,Sarah-Jayne Gratton,359695,29343,198150
8,@ChristopherIsak,Christopher Isak,200876,729,32850
9,@LouisSerge,Louis-Serge,1055876,81140,43718

## 3. Sort your query

In [5]:
output= "SELECT user_id, followers from user where followers>150000 order by followers desc "
cursor.execute(output)
pd.DataFrame(cursor.fetchall(), columns=['user_id','followers'])

            user_id  followers
0       @LouisSerge    1055876
1   @TheNationalUAE     890112
2          @Merca20     501742
3            @Wipro     371224
4      @grattongirl     359695
5       @grattonboy     345866
6  @ChristopherIsak     200876
7       @KirkDBorne     187943
8      @evankirstel     171102
9        @m_kayveas     153029

## 4. Group by an attribute

In [6]:
output= "SELECT date, count(*) as srt from tweet_details group by date order by srt desc limit 10 "
cursor.execute(output)
pd.DataFrame(cursor.fetchall(), columns=['Tweet_id','Count of Tweets'])

     Tweet_id  Count of Tweets
0  2018-02-26             1430
1  2018-02-28              604
2  2018-03-30              507
3  2018-03-14              486
4  2018-03-12              483
5  2018-03-19              480

## 5. Calculate an aggregate function on an attribute of the group.

In [7]:
output= "SELECT date, sum(retweets) as srt from tweet_details group by date order by srt desc limit 10 "
cursor.execute(output)
pd.DataFrame(cursor.fetchall(), columns=['Date','Sum Of Retweets'])

         Date  Sum Of Retweets
0  2018-03-14           150350
1  2018-03-19            75672
2  2018-02-26            61994
3  2018-03-12            35911
4  2018-02-28            32427
5  2018-03-30            25414

## 6. Use DISTINCT keyword will make it so it only returns one instance of each attribute

In [8]:
output= "SELECT Distinct user_id  from tweet limit 10 "
cursor.execute(output)
pd.DataFrame(cursor.fetchall(), columns=['user_id'])

            user_id
0         @09raptor
1             @0fz3
2           @0xddaa
3            @16AKG
4        @1_Sgr_plz
5         @1stInSEO
6  @2018SocialMedia
7          @2050Age
8       @2601Manish
9           @28421o

## 7. Create a column that is calculated from other columns.

In [9]:
output= "SELECT tweet_id,retweets, favourate, retweets+favourate as SUM from tweet_details limit 15  "
cursor.execute(output)
pd.DataFrame(cursor.fetchall(), columns=['tweet_id','Retweets','favourate','SUM'])

              tweet_id  Retweets  favourate  SUM
0   968036614202150912         2          0    2
1   968036597634564096         2          1    3
2   968036559638482944        77          0   77
3   968036540193673216         2          0    2
4   968036522153869312         0          0    0
5   968036431066271744        23          0   23
6   968036419095670787         2          0    2
7   968036417887596544         4          0    4
8   968036376263438336         0          0    0
9   968036316238700544         0          0    0
10  968036309636874240         8          0    8
11  968036300111646720         1          0    1
12  968036297507041280         7          0    7
13  968036242184134658         0          0    0
14  968036238514114560         0          1    1

## 8. Count all of the null values in a nullable field

In [10]:
output= "SELECT count(*) from tweet where urls='NO_URL'"
cursor.execute(output)
pd.DataFrame(cursor.fetchall(), columns=['Number of NULL Columns'])

   Number of NULL Columns
0                    1730

## 9. In a text field count all of rows in the columns that contain the letter 'a'

In [11]:
output= "SELECT count(*) from tweet where tweet_content like '%a%' "
cursor.execute(output)
pd.DataFrame(cursor.fetchall(), columns=['Count'])

   Count
0   3987

## 10. Subselect columns using a subquery

In [12]:
output= "select tag_id, count(tag_id) as pm from (select tag_id,date as dt from tweet_tags inner join tweet_details where tweet_tags.tweet_id=tweet_details.tweet_id) where dt='2018-02-26' group by tag_id order by pm desc limit 10 "
cursor.execute(output)
pd.DataFrame(cursor.fetchall(), columns=['tag_id','Count'])

  tag_id  Count
0    661    382
1    665    285
2    669    184
3    664    175
4    670    125
5    675    110
6    663    105
7    690     96
8    730     42
9    686     38

## 11. Computationally what is the most expensive operation in the relational data model?

SQL joins are computationally the most expensive operation in relational databases. 
1. If there is no indexing in the table, every record in the 1st table must be compared with each record of 2nd table which gives us the complexity of O(M*N)
2. A cross joint will always be O(N^2), since it has to result in N^2 records.

## 12. Write a function to calculate something relevant to your project. Show that it works.

```
DELIMITER //

CREATE FUNCTION getRetweet(idm  varchar(20)) 
RETURNS FLOAT 
BEGIN 
DECLARE pm FLOAT; 
SET pm:=0; 
SELECT retweets into  pm from retweets where id=idm; 
RETURN pm; 
END//
```

![Alt text](images/functionOutput.png?raw=true "Function Output" )

## 13. When two tables are joined in a relational database what is the resulting data structure?

When we join two tables, we get a new table with all the columns that we selected in the query. 

This generated output is discarded as soon as the work of the query is completed. 
For Example Consider the following query

In [13]:
output= " select tag_id, sum(retweets) as crt from tweet_details as td inner join tweet_tags as tt where td.tweet_id=tt.tweet_id group by tag_id order by crt desc limit 3; "
cursor.execute(output)
pd.DataFrame(cursor.fetchall(), columns=['tag_id','Sum'])

  tag_id    Sum
0    661  52684
1    664  40943
2    665  40783

Here we can see that only the selected two columns Tag_id and Sum are displayed in a tabular format.

## 14. Select and filter some data from a table created by a join.

In [14]:
output= " select tag_id, sum(retweets) as crt from tweet_details as td inner join tweet_tags as tt where td.tweet_id=tt.tweet_id group by tag_id order by crt desc limit 8; "
cursor.execute(output)
pd.DataFrame(cursor.fetchall(), columns=['tag_id','Sum'])

  tag_id    Sum
0    661  52684
1    664  40943
2    665  40783
3    669  30525
4    801  15816
5    807  14407
6    675  14302
7    670  12275

## 15. Why not put all the data in one big table and avoid all of these joins?

##### Relationship
1. If the relationship between multiple colums is one-to-one then it better to store the data in one table, since it reduces the number of joins the table has to do. 
2. If the relationship between two tables in one-to-many, then it will be better to split into seperate tables to reduce duplicate data. Duplicate data wastes lots of storage and cache space and makes database harder to maintain. 

##### Computation 
1. We should always start by 3NF form and only denormalise if we find a specific performance problem. 
2. Also, by storing all the data in a single table, makes querying the table expensive as querying a large table for a single value is more costly than querying two small tables. 
3. Also, by storing it in one table and duplicating data, we run a risk of allowing inconsistant data to be inserted into database thus nullifying one of the core properties of Relational databases (ACID)
4. When we store all the data in a single large table, if a remote server needs a single value for the table, entire table needs to be transferred through network, which increases network transmission times. If the data is stored in normalised form, this can be avoided. 

Thus, even though Joins are expensive, there are many factors to be considered while designing a database. Joins are needed only when we need data from two tables, where rest of the above reasons together combined can be more expensive than joins. 
Also, we can reduce repeated joins by creating a view of the table with joins and query it.

## 16. Why create views?

Creating views has several benifits.

##### 1. Views can hide complexity
If we have a query thar requires joining several tables or has a comples logic/ calculations, we can create a view and query it just like tables. THus, a view is encapsulation of a complex or expensive query.

##### 2. Views can be used as a security mechanism
With a view, we can select certain columns and/or rows from a table, and can set permissions on the view instead of the underlying tables. This allows surfacing only the data that a user needs to see and rest of the data can be hidden from the user. 

##### 3. To Denormalise data for reporting purpose
We can use a view to denormalise and/ or aggregate the tables. This results in reducing the redundancy in writing the queries also maximizing the performance of the database. 

##### 4. Refactoring Database
We can hide the change so that the old code does not see it by creating a view.

## 17. Select and filter some data from a table created by a view.

In [15]:
output= "Create view ViewDemo as select user_id, tweet_content, retweets from tweet as t inner join tweet_details as td where t.tweet_id=td.tweet_id order by td.retweets desc;"
cursor.execute(output)
# pd.DataFrame(cursor.fetchall(), columns=['user_id','Tweet Content','Retweets'])

In [16]:
output= "Select * from ViewDemo where retweets=3439"
cursor.execute(output)
pd.DataFrame(cursor.fetchall(), columns=['user_id','Tweet Content','Retweets'])

,user_id,Tweet Content,Retweets
0,@Absolute_Virtue,RT @liu_mingyu: Given a content photo and a st...,3439

## 18. Why create temporary tables?

A Temporary Table is only visible to the current session and is dropped automatically once the session ends. This means that two different sessions can use the same temporary table name without conflicting with each other or with an existing non-temporary table of the same name.

This has several advantages,
1. We can pull data from various tables, do some work on that data and then combine everything into one result set. 
2. We can use temporary table for tilting the data i.e. turning rows to columns, etc. which we need for advance processing.

## 19. Select and filter some data from a table created by a temporary table.

In [17]:
output= "CREATE TEMPORARY TABLE ABC AS select user_id, tweet_content, retweets from tweet as t inner join tweet_details as td where t.tweet_id=td.tweet_id order by td.retweets desc"
cursor.execute(output)
# pd.DataFrame(cursor.fetchall(), columns=['user_id','Tweet Content','Retweets'])

In [18]:
output= "Select * from ABC limit 10"
cursor.execute(output)
pd.DataFrame(cursor.fetchall(), columns=['user_id','Tweet Content','Retweets'])

,user_id,Tweet Content,Retweets
0,@metfan62,RT @JohnBrennan: You show an amazing albeit un...,17503
1,@Chewster2e,RT @JohnBrennan: You show an amazing albeit un...,17503
2,@detroitrueblue,RT @JohnBrennan: You show an amazing albeit un...,17503
3,@lisaelyea,RT @JohnBrennan: You show an amazing albeit un...,15580
4,@MadameLazet,RT @mcuban: Automation is going to cause unemp...,3582
5,@invokermidas,RT @dbrainio: With Dbrain AI apps creation bec...,3552
6,@black_matvey,RT @dbrainio: With Dbrain AI apps creation bec...,3552
7,@Absolute_Virtue,RT @liu_mingyu: Given a content photo and a st...,3439
8,@Blx0eejDHM6VX25,RT @dbrainio: With Dbrain AI apps creation bec...,2393
9,@LgPHVgicLey8Mcv,RT @dbrainio: With Dbrain AI apps creation bec...,2393

## 20. Insert some data in to a table.

In [19]:
output= "SELECT * from user where user_id='@Pratik'"
cursor.execute(output)
pd.DataFrame(cursor.fetchall(), columns=['User_id','User Name','Following','Followers','TweetCount'])

Empty DataFrame
Columns: [User_id, User Name, Following, Followers, TweetCount]
Index: []

In [20]:
output= "Insert into user values('@Pratik','Demo Add User', 100000,10 , 9999)"
cursor.execute(output)

In [21]:
output= "SELECT * from user where user_id='@Pratik'"
cursor.execute(output)
pd.DataFrame(cursor.fetchall(), columns=['User_id','User Name','Followers','Following','TweetCount'])

   User_id      User Name  Followers  Following  TweetCount
0  @Pratik  Demo Add User     100000         10        9999

## 21. Update some data in a table.

In [22]:
output= "Update user SET following=50 where user_id='@Pratik'"
cursor.execute(output)
# pd.DataFrame(cursor.fetchall(), columns=['User_id','User Name','Following','Followers','TweetCount'])

In [23]:
output= "SELECT * from user where user_id='@Pratik'"
cursor.execute(output)
pd.DataFrame(cursor.fetchall(), columns=['User_id','User Name','Followers','Following','TweetCount'])

   User_id      User Name  Followers  Following  TweetCount
0  @Pratik  Demo Add User     100000         50        9999

## 22. Delete some data a table.

In [24]:
output= "Delete from user where user_id='@Pratik'"
cursor.execute(output)
# pd.DataFrame(cursor.fetchall(), columns=['User_id','User Name','Followers','Following','TweetCount'])

In [25]:
output= "SELECT * from user where user_id='@Pratik'"
cursor.execute(output)
pd.DataFrame(cursor.fetchall(), columns=['User_id','User Name','Followers','Following','TweetCount'])

Empty DataFrame
Columns: [User_id, User Name, Followers, Following, TweetCount]
Index: []

## 23. Create a stored routine that does something useful for your project.

```
CREATE FUNCTION diffrt(idm  varchar(20),idb varchar(20))
RETURNS FLOAT
BEGIN
DECLARE pm FLOAT;
DECLARE pmb FLOAT;
SET pm:=0;
SET pmb:=0;
SELECT retweets into  pm from retweets where id=idm;
SELECT retweets into  pmb from retweets where id=idb;
Return pm-pmb;
END//
```

![Alt text](images/routineout.png?raw=true "Function Output" )

## 24. Create a stored procedures that does something useful for your project.

```
CREATE PROCEDURE tagsofuser(usr varchar(50))
BEGIN
SELECT tag_id from user_tags where user_id=usr;
END//
```

![Alt text](images/outputProcedure.png?raw=true "Procedure Execution" )

## 25. Create a index on a non-key attribute. Does it help?

![Alt text](images/indexing.png?raw=true "Trigger Demo")

As we can see above, the query without indexing takes  0.000081 seconds to execute. But the same query takes 0.000066 seconds to execute with indexing. 

Thus we can see that indexing helps us in this case.

## 26. Create a trigger.

##### Creating Table for User Log

![Alt text](images/createTable.png?raw=true "Create Table")

##### Creating Trigger

![Alt text](images/createTrigger.png?raw=true "Create Trigger" )

```
CREATE TRIGGER USERLOG AFTER INSERT 
ON user
BEGIN
INSERT INTO user_log values(new.user_id, datetime('now'));
END;
```

##### Trigger Demo

![Alt text](images/triggerdemo.png?raw=true "Trigger Demo")

## 27. Create a transaction.

![Alt text](images/transaction.png?raw=true "Transaction Demo")

## 28. Explain to an eight year old what are the first three Normal Forms.

There are 3 common forms of Normalization. i.e. 1st, 2nd and 3rd Normal Form. 

These Normalization rules are progressive i.e. to be in 3rd normal form, the data must satisfy 2nd normal. 
Similarly, to be in 2nd normal form, the data must satisfy 1st normal form. 

**`First Normal Form`** 

The data is stored in a relational table and each column contains a atomic value i.e only a single value
and there are no repeating group of columns i.e collection of columns containing similar kinds of values in a table.

For example, in the case of a table called Person with columns named Name, Family Name, Phone 1, Phone 2, Phone 3, Phone 4 ... etc the collection of columns Phone N is referred to as a repeating group and assumed to be in violation of 1NF even though it is not a repeating group.


**`Second Normal Form`**

The data stored in the table is in 1st normal form and all the columns in the table depend on the primary key of the table. 

A Primary Key is a field in the table which uniquely identifies every row in the table. All the primary keys must contain a unique record and it cannot be null i.e without a value. 

**`Third Normal Form`**

The data stored in the table must be in 2nd normal form and all of its columns are non-transitively dependent on the primary key of the table. 

By non-transitive dependency, we mean that there should not be any indirect relation between the columns and the primary key of the table. 

for example, in a table of College courses, if we have columns like
```
Course_id-----CRN-----Professor_name-----Course_name
```
Here, CRN is dependent on Course_id but Professor_name is dependent on CRN, thus there is a transitive dependency between Professor_name and Course_id i.e. there is an indirect dependency between Professor_name and Course_id. This is a voilation of 3rd Normal Form, thus, it is not acceptable.